In [2]:
import pandas as pd
import numpy as np

What are Best Practices:
1.	Best Practices is not work procedure. Its notes of experience on Do’s and Don’ts and easiest possible approaches.
2.	Avoiding problem approaches which tricks us most of time.
3.	Avoiding functionalities which has bugs in it or when using with cross platforms.
4.	Identifying the easiest approach when multiple approaches are available.

# Notes Summary:
1. Conditional indexing - df.index[]: we can use index function not only to get the total list of    index in a given dataframe, but also get a sliced index using conditional indexing.
    1. df.index - will give the total list of index in a given dataframe
    2. df.index[] - will give a sliced index using conditional indexing
2. Convertion of string index to range index:                                                         
    1. we can get range index only for one value at a time using df.index.get_loc().
    2. use list comprehension get to all / a subset of range index.[df.index.get_loc(i) for i in list(df.index)]
3. Shorting with multi columns is possiable by passing list of columns
4. Slicing the datafarame between two values of a column. eg.df[df['score'].between(15, 20)]
5. Replacing values in a Dataframe.
    1. Use df.column.map(dict()) to replace all value in a column with another or same value. values not mentioned in dict will be replaced with nan values.
    2. use replace(['old values'], ['New Value']) for replacing list of values to equivalent list of values.
6. Dataframe can be itterable using df.iterrows()
7. Self assign the dataframe to itself when appling functions which dont have inplace option.
    1. df.append()
    2. df.apply()
    3. df.column.map()
    4. ...
8. keep index = False while writing dataframe to file, unless you need to retain index. Else we will get index as a new column while reading it back to pandas.
9. Keep drop=True while using df.reset_index to avoid extra column with index in DF.
10. Count will give total non-na values present in a column. Size will give total row count in a column, even if there are nan values. So use size instead count to know how the length of a DF or sliced dataframe.
11. use df.sample(frac=1) to shaffle the rows in a dataframe.
12. After groupby we can call other columns and apply agg function to it, instead of applying agg functions directly to groupby function
13. Conditional filtering can be done on columns also eg: df.loc[:, df.columns != 'col2']
14. Using df.column.astype(dtype) we can change the dtype of total column
15. using df.select_dtypes(include = "number"/"object") we can filter columns with datatype
16. df.read_clipboard will not work in cloud notebooks, as cant fetch from ur local system. works in local jupyter notebook

DataFrame

In [3]:
exam_data = {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df=pd.DataFrame(exam_data,index=labels)
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

1. Conditional indexing - df.index[]: we can use index function not only to get the total list of index in a given dataframe, but also get a sliced index using conditional indexing.
    1. df.index - will give the total list of index in a given dataframe
    2. df.index[] - will give a sliced index using conditional indexing

In [15]:
print(df.index)
l=df.index[df['score'] == 9.0].tolist()
l

Index(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'], dtype='object')

['b', 'e']

2. Convertion of string index to range index:                                                         
    1. we can get range index only for one value at a time using df.index.get_loc().
    2. use list comprehension get to all / a subset of range index.[df.index.get_loc(i) for i in list(df.index)]

In [9]:
[df.index.get_loc(i) for i in l]

[1, 4]

3. Shorting with multi columns is possiable by passing list of columns

In [10]:
df.sort_values(by=['name', 'score'], ascending=[False, True])

        name  score  attempts qualify
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
c  Katherine   16.5         2     yes
j      Jonas   19.0         1     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
b       Dima    9.0         3      no
a  Anastasia   12.5         1     yes

4. Slicing the datafarame between two values of a column.

In [11]:
df[df['score'].between(15, 20)]

        name  score  attempts qualify
c  Katherine   16.5         2     yes
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes

5. Replacing values in a Dataframe.
    1. Use df.column.map(dict()) to replace all value in a column with another or same value. values not mentioned in dict will be replaced with nan values.
    2. use replace(['old values'], ['New Value']) for replacing list of values to equivalent list of values.

In [16]:
# Map function
# Total column only 2 values yes, No
df['qualify'] = df['qualify'].map({'yes': True, 'no': False})
df

        name  score  attempts  qualify
a  Anastasia   12.5         1     True
b       Dima    9.0         3    False
c  Katherine   16.5         2     True
d      James    NaN         3    False
e      Emily    9.0         2    False
f    Michael   20.0         3     True
g    Matthew   14.5         1     True
h      Laura    NaN         1    False
i      Kevin    8.0         2    False
j      Jonas   19.0         1     True

In [17]:
# Replace Function
df.name.replace(['Dima','Katherine'],['Dakota Mayi','Demi'])

a      Anastasia
b    Dakota Mayi
c           Demi
d          James
e          Emily
f        Michael
g        Matthew
h          Laura
i          Kevin
j          Jonas
Name: name, dtype: object

6. Dataframe can be itterable using df.iterrows()

In [18]:
for index, i in df.iterrows():
    print(i['name'], i['score'])

Anastasia 12.5
Dima 9.0
Katherine 16.5
James nan
Emily 9.0
Michael 20.0
Matthew 14.5
Laura nan
Kevin 8.0
Jonas 19.0

7. Self assign the dataframe to itself when appling functions which dont have inplace option.
    1. df.append()
    2. df.apply()
    3. df.column.map()
    4. ...

8. keep index = False while writing dataframe to file, unless you need to retain index. Else we will get index as a new column while reading it back to pandas.

In [19]:
df.to_csv('op.csv')

In [20]:
pd.read_csv('/content/op.csv') # Unnamed

  Unnamed: 0       name  score  attempts  qualify
0          a  Anastasia   12.5         1     True
1          b       Dima    9.0         3    False
2          c  Katherine   16.5         2     True
3          d      James    NaN         3    False
4          e      Emily    9.0         2    False
5          f    Michael   20.0         3     True
6          g    Matthew   14.5         1     True
7          h      Laura    NaN         1    False
8          i      Kevin    8.0         2    False
9          j      Jonas   19.0         1     True

9. Keep drop=True while using df.reset_index to avoid extra column with index in DF

In [42]:
df.reset_index()

   index  a    b
0      0  1    4
1      1  2  NaN
2      2  3    6

In [43]:
df.reset_index(drop=True)

   a    b
0  1    4
1  2  NaN
2  3    6

10. Count will give total non-na values present in a column. Size will give total row count in a column, even if there are nan values. So use size instead count to know how the length of a DF or sliced dataframe.

In [37]:
df7 = pd.DataFrame({'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'age': [22,23,24,np.nan,26,27,28,29,30,31],     
'city': ['California', 'Los Angeles', 'California', 'California', 'California', 'Los Angeles', 'Los Angeles', 'Georgia', 'Georgia', 'Los Angeles']
                   })
df7

        name   age         city
0  Anastasia  22.0   California
1       Dima  23.0  Los Angeles
2  Katherine  24.0   California
3      James   NaN   California
4      Emily  26.0   California
5    Michael  27.0  Los Angeles
6    Matthew  28.0  Los Angeles
7      Laura  29.0      Georgia
8      Kevin  30.0      Georgia
9      Jonas  31.0  Los Angeles

In [40]:
df7.groupby('city').age.size()

city
California     4
Georgia        2
Los Angeles    4
Name: age, dtype: int64

In [41]:
# we should not use count method to calculate no of persons per city. See in California value shows wrong
df7.groupby('city').age.count()

city
California     3
Georgia        2
Los Angeles    4
Name: age, dtype: int64

11. use df.sample(frac=1) to shaffle the rows in a dataframe

In [46]:
df.sample(frac=1)

   a    b
2  3    6
0  1    4
1  2  NaN

12. After groupby we can call other columns and apply agg function to it, instead of applying agg functions directly to groupby function

In [50]:
df10 = pd.DataFrame( {'col1':['C1','C1','C2','C2','C2','C3','C2'], 'col2':[1,2,3,3,4,6,5]})
df10

  col1  col2
0   C1     1
1   C1     2
2   C2     3
3   C2     3
4   C2     4
5   C3     6
6   C2     5

In [51]:
df10.groupby('col1')['col2'].apply(list)

col1
C1          [1, 2]
C2    [3, 3, 4, 5]
C3             [6]
Name: col2, dtype: object

13. Conditional filtering can be done on columns also eg:df.loc[:, df.columns != 'col2']

In [52]:
df10.loc[:, df10.columns != 'col2']

  col1
0   C1
1   C1
2   C2
3   C2
4   C2
5   C3
6   C2

14. Using df.column.astype(dtype) we can change the dtype of total column

In [54]:
df10.col2 = df10.col2.astype(float)
df10

  col1  col2
0   C1   1.0
1   C1   2.0
2   C2   3.0
3   C2   3.0
4   C2   4.0
5   C3   6.0
6   C2   5.0

15. using df.select_dtypes(include = "number"/"object") we can filter columns with datatype

In [55]:
df10.select_dtypes(include = "number")

   col2
0   1.0
1   2.0
2   3.0
3   3.0
4   4.0
5   6.0
6   5.0

16. df.read_clipboard will not work in cloud notebooks, as cant fetch from ur local system. works in local jupyter notebook